pulsarfab/pulsarfab/firmware/pulsardewpro/sdkconfig.defaults
# PulsarDewPro ESP-IDF configuration defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# WiFi
CONFIG_ESP_WIFI_SSID=""
CONFIG_ESP_WIFI_PASSWORD=""

# HTTP server for ASCOM Alpaca
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# USB CDC console
CONFIG_ESP_CONSOLE_USB_CDC=y
